Repository: iputils/iputils
Catalog: po/*.po
Languages: it, zh_hant

source: Usage: arping [options] <destination> Options: -f quit on first reply -q be quiet -b keep on broadcasting, do not unicast -D duplicate address detection mode -U unsolicited ARP mode, update your neighbours -A ARP answer mode, update your neighbours -V print version and exit -c <count> how many packets to send -w <timeout> how long to wait for a reply -i <interval> set interval between packets (default: 1 second) -I <device> which ethernet device to use
it: Uso: arping [opzioni] <destinazione> Opzioni: -f esce alla prima risposta -q silenzioso -b continua a trasmettere in broadcast, non in unicast -D modalità rilevamento indirizzi duplicati -U modalità ARP spontanea, aggiorna i vicini -A modalità risposta ARP, aggiorna i vicini -V stampa la versione ed esce -c <numero> quanti pacchetti inviare -w <timeout> quanto tempo attendere per una risposta -i <intervallo> imposta l'intervallo tra i pacchetti (predefinito: 1 secondo) -I <disp> quale dispositivo ethernet usare

source: -s <source> source IP address <destination> DNS name or IP address For more details see arping(8).
it: -s <sorgente> indirizzo IP sorgente <destinazione> nome DNS o indirizzo IP Per maggiori dettagli consultare arping(8).
zh_hant: -s <source> 來源 IP 位址 <destination> DNS 名稱或 IP 位址 如需詳細資訊，請參閱 arping(8)。

source: Sent %d probes (%d broadcast(s))
it: Inviate %d sonde (%d in broadcast)
zh_hant: 已傳送 %d 探測 (%d 廣播)

source: Received %d response(s)
it: Ricevute %d risposte
zh_hant: 收到 %d 回覆

source: %d request(s)
it: %d richieste
zh_hant: %d 請求

source: %s%d broadcast(s)
it: %s%d in broadcast
zh_hant: %s%d 廣播

source: %s from
it: %s da
zh_hant: %s 來自

source: reply
it: risposta
zh_hant: 回覆

source: request
it: richiesta
zh_hant: 請求

source: for %s
it: per %s
zh_hant: 於 %s

source: for
it: per
zh_hant: 於

source: UNSOLICITED?
it: SPONTANEO?
zh_hant: 不受歡迎？

source: Interface "%s" is down
it: L'interfaccia "%s" è inattiva
zh_hant: 介面 "%s" 已關閉

source: Interface "%s" is not ARPable
it: L'interfaccia "%s" non supporta ARP
zh_hant: 介面 "%s" 不是 ARPable

source: WARNING: using default broadcast address.
it: ATTENZIONE: uso dell'indirizzo di broadcast predefinito.
zh_hant: 警告：使用預設廣播位址。

source: invalid argument
it: argomento non valido
zh_hant: 無效論點

source: Device %s not available.
it: Dispositivo %s non disponibile.
zh_hant: 裝置 %s 不可用。

source: Suitable device could not be determined. Please, use option -I.
it: Impossibile determinare un dispositivo idoneo. Usare l'opzione -I.
zh_hant: 無法確定適合的裝置。 請使用選項 -I。

source: WARNING: interface is ignored
it: ATTENZIONE: l'interfaccia è ignorata
zh_hant: 警告：介面被忽略

source: WARNING: setsockopt(SO_DONTROUTE)
it: ATTENZIONE: setsockopt(SO_DONTROUTE)
zh_hant: 警告：setsockopt(SO_DONTROUTE)

source: Interface "%s" is not ARPable (no ll address)
it: L'interfaccia "%s" non supporta ARP (nessun indirizzo di livello link)
zh_hant: 介面 "%s" 不可 ARPable (沒有 ll 位址)

source: from %s %s
it: da %s %s
zh_hant: 來自 %s %s

source: no source address in not-DAD mode
it: nessun indirizzo sorgente in modalità non-DAD
zh_hant: 在非 DAD 模式下無來源位址

source: Wrong timestamp %d
it: Timestamp %d errato
zh_hant: 錯誤的時間戳記 %d

source: Overflow %d hops
it: Overflow di %d hop
zh_hant: 溢出 %d 跳躍

source: wrong timestamps
it: timestamp errati
zh_hant: 錯誤的時間戳

source: Usage: clockdiff [options] <destination> Options: without -o, use icmp timestamp only (see RFC0792, page 16) -o use IP timestamp and icmp echo -o1 use three-term IP timestamp and icmp echo -T, --time-format <ctime|iso> specify display time format, ctime is the default -I alias of --time-format=iso -h, --help display this help -V, --version print version and exit <destination> DNS name or IP address For more details see clockdiff(8).
it: Uso: clockdiff [opzioni] <destinazione> Opzioni: senza -o, usa solo il timestamp icmp (vedere RFC0792, pagina 16) -o usa il timestamp IP e l'echo icmp -o1 usa il timestamp IP a tre termini e l'echo icmp -T, --time-format <ctime|iso> specifica il formato dell'ora visualizzata, ctime è il predefinito -I alias di --time-format=iso -h, --help visualizza questo aiuto -V, --version stampa la versione ed esce <destinazione> nome DNS o indirizzo IP Per maggiori dettagli consultare clockdiff(8).

source: measure: unknown failure
it: misura: errore sconosciuto

source: %s is down
it: %s è inattivo
zh_hant: %s 已停機

source: %s time transmitted in a non-standard format
it: orario di %s trasmesso in un formato non standard
zh_hant: 以非標準格式傳送的 %s 時間

source: %s is unreachable
it: %s non è raggiungibile
zh_hant: %s 無法連線

source: Qtype conflict
it: Conflitto Qtype
zh_hant: Qtype 衝突

source: Subject type conflict
it: Conflitto Subject type
zh_hant: 主題類型衝突

source: IDN encoding error: %s
it: Errore di codifica IDN: %s
zh_hant: IDN 編碼錯誤：%s

source: too long scope name
it: nome dello scope troppo lungo
zh_hant: 範圍名稱太長

source: memory allocation failed
it: allocazione memoria non riuscita
zh_hant: 分配記憶體失敗

source: inappropriate subject name: %s
it: nome del soggetto non appropriato: %s
zh_hant: 不適當的主題名稱：%s

source: dn_comp() returned too long result
it: dn_comp() ha restituito un risultato troppo lungo
zh_hant: dn_comp() 回傳太長的結果

source: ping -6 -N <nodeinfo opt> Help: help Query: name ipv6 ipv6-all ipv6-compatible ipv6-global ipv6-linklocal ipv6-sitelocal ipv4 ipv4-all Subject: subject-ipv6=addr subject-ipv4=addr subject-name=name subject-fqdn=name
it: ping -6 -N <opzione nodeinfo> Aiuto: help Interrogazione: name ipv6 ipv6-all ipv6-compatible ipv6-global ipv6-linklocal ipv6-sitelocal ipv4 ipv4-all Soggetto: subject-ipv6=addr subject-ipv4=addr subject-name=name subject-fqdn=name

source: unknown protocol family: %d
it: famiglia di protocolli sconosciuta: %d
zh_hant: 未知通訊協定家族：%d

source: unknown sock type: %d
it: tipo di socket sconosciuto: %d
zh_hant: 未知sock類型：%d

source: => missing cap_net_raw+p capability or setuid?
it: => manca la capacità cap_net_raw+p o setuid?
zh_hant: => 缺少 cap_net_raw+p 功能或 setuid？

source: option argument contains garbage: %s
it: l'argomento dell'opzione contiene dati spazzatura: %s
zh_hant: 選項參數包含垃圾：%s

source: this will become fatal error in the future
it: questo diventerà un errore fatale in futuro
zh_hant: 這將會成為日後的致命錯誤

source: bad value for flowinfo: %s
it: valore errato per flowinfo: %s
zh_hant: flowinfo 的不良值： %s

source: flow value is greater than 20 bits: %s
it: il valore del flusso è maggiore di 20 bit: %s
zh_hant: 流量值大於 20 位元：%s

source: bad TOS value: %s
it: valore TOS errato: %s
zh_hant: 錯誤的 TOS 值：%s

source: the decimal value of TOS bits must be in range 0-255: %d
it: il valore decimale dei bit TOS deve essere compreso tra 0 e 255: %d
zh_hant: TOS 位元的十進位值範圍必須是 0-255: %d

source: only one -4 or -6 option may be specified
it: può essere specificata solo una tra le opzioni -4 o -6
zh_hant: 只能指定一個 -4 或 -6 選項

source: only one of -T or -R may be used
it: può essere usata solo una tra -T o -R
zh_hant: 只能使用 -T 或 -R 其中之一

source: invalid timestamp type: %s
it: tipo di timestamp non valido: %s
zh_hant: 時間戳類型無效：%s

source: bad timing interval
it: intervallo temporale errato
zh_hant: 不良的時間間隔

source: bad timing interval: %s
it: intervallo temporale errato: %s
zh_hant: 不良的定時間隔：%s

source: cannot copy: %s
it: impossibile copiare: %s
zh_hant: 無法複製：%s

source: invalid source address: %s
it: indirizzo sorgente non valido: %s
zh_hant: 無效來源位址： %s

source: cannot set preload to value greater than 3: %d
it: impossibile impostare il precaricamento a un valore maggiore di 3: %d
zh_hant: 無法設定預載值大於 3: %d

source: invalid -M argument: %s
it: argomento -M non valido: %s
zh_hant: 無效 -M 參數：%s

source: bad linger time
it: tempo di attesa (linger) errato
zh_hant: 不良徘徊時間

source: bad linger time: %s
it: tempo di attesa (linger) errato: %s
zh_hant: 不良徘徊時間：%s

source: WARNING: reverse DNS resolution (PTR lookup) disabled, enforce with -H
it: ATTENZIONE: risoluzione DNS inversa (ricerca PTR) disabilitata, forzarla con -H
zh_hant: 警告：已停用 DNS 反向解析 (PTR 查詢)，請使用 -H 強制執行

source: WARNING: ident 0 => forcing raw socket
it: ATTENZIONE: ident 0 => forzatura raw socket
zh_hant: 警告：識別碼 0 => 強制原始套接字

source: invalid -s value: '%d': out of range: 0 <= value <= %d
it: valore -s non valido: '%d': fuori intervallo: 0 <= valore <= %d

source: Warning: IPv6 link-local address on ICMP datagram socket may require ifname or scope-id => use: address%%<ifname|scope-id>
it: Attenzione: l'indirizzo link-local IPv6 su socket di datagrammi ICMP potrebbe richiedere ifname o scope-id => usare: indirizzo%%<ifname|scope-id>

source: unknown iface: %s
it: interfaccia sconosciuta: %s
zh_hant: 未知 iface：%s

source: warning: QOS sockopts
it: attenzione: opzioni socket QOS

source: Do you want to ping broadcast? Then -b. If not, check your local firewall rules
it: Si desidera eseguire il ping di broadcast? Usare -b. In caso contrario, controllare le regole del firewall locale

source: WARNING: pinging broadcast address
it: ATTENZIONE: ping dell'indirizzo di broadcast in corso

source: cannot set broadcasting
it: impossibile impostare il broadcast

source: gatifaddrs failed
it: gatifaddrs non riuscita

source: Warning: source address might be selected on device other than: %s
it: Attenzione: l'indirizzo sorgente potrebbe essere selezionato su un dispositivo diverso da: %s
zh_hant: 警告：來源位址可能在裝置上被選取，而不是：%s

source: minimal interval for broadcast ping for user must be >= %d ms, use -i %s (or higher)
it: l'intervallo minimo per il ping di broadcast per l'utente deve essere >= %d ms, usare -i %s (o superiore)

source: broadcast ping does not fragment
it: il ping di broadcast non frammenta

source: WARNING: setsockopt(ICMP_FILTER)
it: ATTENZIONE: setsockopt(ICMP_FILTER)
zh_hant: 警告：setsockopt(ICMP_FILTER)

source: WARNING: your kernel is veeery old. No problems.
it: ATTENZIONE: il kernel è molto vecchio. Nessun problema.
zh_hant: 警告：您的核心已經很舊了。 沒有問題。

source: WARNING: setsockopt(IP_RECVTTL)
it: ATTENZIONE: setsockopt(IP_RECVTTL)
zh_hant: 警告：setsockopt(IP_RECVTTL)

source: WARNING: setsockopt(IP_RETOPTS)
it: ATTENZIONE: setsockopt(IP_RETOPTS)
zh_hant: 警告：setsockopt(IP_RETOPTS)

source: cannot disable multicast loopback
it: impossibile disabilitare il loopback multicast
zh_hant: 無法停用群播回送

source: cannot set multicast time-to-live
it: impossibile impostare il time-to-live multicast
zh_hant: 無法設定群播生存時間

source: cannot set unicast time-to-live
it: impossibile impostare il time-to-live unicast
zh_hant: 無法設定單點傳送的生存時間

source: (same route)
it: (stessa rotta)
zh_hant: (相同路線)

source: %ld absolute not-standard
it: %ld assoluto non standard
zh_hant: %ld 絕對不標準

source: %ld not-standard
it: %ld non standard
zh_hant: %ld 非標準

source: %ld absolute
it: %ld assoluto
zh_hant: %ld 絕對值

source: Unrecorded hops: %d
it: Hop non registrati: %d
zh_hant: 未記錄的跳數：%d

source: unknown option %x
it: opzione %x sconosciuta
zh_hant: 未知選項 %x

source: Vr HL TOS Len ID Flg off TTL Pro cks Src Dst Data
it: Vr HL TOS Lung ID Flg off TTL Pro cks Sorg Dest Dati

source: Echo Reply
it: Risposta Echo
zh_hant: 回應回覆

source: Destination Net Unreachable
it: Rete di destinazione non raggiungibile
zh_hant: 無法連線的目的地網路

source: Destination Host Unreachable
it: Host di destinazione non raggiungibile
zh_hant: 無法連線的目的地網路

source: Destination Protocol Unreachable
it: Protocollo di destinazione non raggiungibile
zh_hant: 無法連線的目的地通訊協定

source: Destination Port Unreachable
it: Porta di destinazione non raggiungibile
zh_hant: 無法連線的目的地連接埠

source: Frag needed and DF set (mtu = %u)
it: Frammentazione necessaria e bit DF impostato (mtu = %u)
zh_hant: 需要 Frag 並已設定 DF (mtu = %u)

source: Source Route Failed
it: Instradamento alla sorgente non riuscito
zh_hant: 來源路由己失敗

source: Destination Net Unknown
it: Rete di destinazione sconosciuta
zh_hant: 目的地網路未知

source: Destination Host Unknown
it: Host di destinazione sconosciuto
zh_hant: 目的地主機未知

source: Source Host Isolated
it: Host sorgente isolato
zh_hant: 來源主機己隔離

source: Destination Net Prohibited
it: Rete di destinazione vietata
zh_hant: 己禁止目的地網路

source: Destination Host Prohibited
it: Host di destinazione vietato
zh_hant: 己禁止目的地主機

source: Destination Net Unreachable for Type of Service
it: Rete di destinazione non raggiungibile per il Type of Service
zh_hant: 服務類型無法連線的目的地網路

source: Destination Host Unreachable for Type of Service
it: Host di destinazione non raggiungibile per il Type of Service
zh_hant: 服務類型無法連線的目的地主機

source: Packet filtered
it: Pacchetto filtrato
zh_hant: 封包己過濾

source: Precedence Violation
it: Violazione di precedenza
zh_hant: 違反優先順序

source: Precedence Cutoff
it: Interruzione di precedenza
zh_hant: 優先切換

source: Dest Unreachable, Bad Code: %d
it: Destinazione non raggiungibile, codice errato: %d

source: Source Quench
it: Rallentamento sorgente (Source Quench)
zh_hant: 來源抑制

source: Redirect Network
it: Ridirigimento rete
zh_hant: 網路重新導向

source: Redirect Host
it: Ridirigimento host
zh_hant: 主機重新導向

source: Redirect Type of Service and Network
it: Ridirigimento Type of Service e rete
zh_hant: 重新導向服務類型與網路

source: Redirect Type of Service and Host
it: Ridirigimento Type of Service e host
zh_hant: 重新導向服務類型與主機

source: Redirect, Bad Code: %d
it: Ridirigimento, codice errato: %d
zh_hant: 重新導向，不良代碼： %d

source: (New nexthop: %s)
it: (Nuovo nexthop: %s)
zh_hant: (新的 nexthop: %s)

source: Echo Request
it: Richiesta Echo
zh_hant: 要求回應

source: Time to live exceeded
it: Time to live superato
zh_hant: 超過生存時間

source: Frag reassembly time exceeded
it: Tempo di riassemblaggio frammenti superato
zh_hant: 超過 Frag 重組時間

source: Time exceeded, Bad Code: %d
it: Tempo superato, codice errato: %d
zh_hant: 超過時間，不良代碼： %d

source: Parameter problem: pointer = %u
it: Problema nei parametri: puntatore = %u
zh_hant: 參數問題：指針 = %u

source: Timestamp Reply
it: Risposta Timestamp
zh_hant: 時間戳回覆

source: Information Request
it: Richiesta informazioni
zh_hant: 資訊請求

source: Information Reply
it: Risposta informazioni
zh_hant: 資訊回覆

source: Address Mask Request
it: Richiesta maschera di indirizzo
zh_hant: 位址遮罩請求

source: Address Mask Reply
it: Risposta maschera di indirizzo
zh_hant: 位址遮罩回覆

source: Bad ICMP type: %d
it: Tipo ICMP errato: %d
zh_hant: 錯誤的 ICMP 類型：%d

source: local error
it: errore locale
zh_hant: 本地錯誤

source: local error: message too long, mtu=%u
it: errore locale: messaggio troppo lungo, mtu=%u
zh_hant: 本地錯誤：訊息太長，mtu=%u

source: packet too short (%d bytes) from %s
it: pacchetto troppo breve (%d byte) da %s
zh_hant: 封包太短 ( %d 位元組) 來自 %s

source: From %s: icmp_seq=%u
it: Da %s: icmp_seq=%u
zh_hant: 來自 %s: icmp_seq=%u

source: (BAD CHECKSUM)
it: (CHECKSUM ERRATO)
zh_hant: （錯誤校驗和）

source: From %s:
it: Da %s:
zh_hant: 來自 %s

source: (BAD CHECKSUM)
it: (CHECKSUM ERRATO)
zh_hant: （錯誤校驗和）

source: WARNING: failed to install socket filter
it: ATTENZIONE: installazione del filtro socket non riuscita
zh_hant: 警告：未安裝socket過濾器

source: %d(%d) bytes of data.
it: %d(%d) byte di dati.
zh_hant: %d(%d) 位元組的資料。

source: scope discrepancy among the nodes
it: discrepanza di scope tra i nodi
zh_hant: 節點間的範圍差異

source: minimal interval for multicast ping for user must be >= %d ms, use -i %s (or higher)
it: l'intervallo minimo per il ping multicast per l'utente deve essere >= %d ms, usare -i %s (o superiore)
zh_hant: 使用者群播傳送 ping 的最小間隔必須 >= %d ms，使用 -i %s (或更高)

source: multicast ping does not fragment
it: il ping multicast non frammenta
zh_hant: 群播傳送 ping 不會分片

source: setsockopt(RAW_CHECKSUM) failed - try to continue
it: setsockopt(RAW_CHECKSUM) non riuscita - tentativo di continuare
zh_hant: setsockopt(RAW_CHECKSUM) 己失敗 - 嘗試繼續

source: can't disable multicast loopback
it: impossibile disabilitare il loopback multicast
zh_hant: 無法停用群播回送

source: can't set multicast hop limit
it: impossibile impostare il limite di hop multicast
zh_hant: 無法設定群播傳送跳數限制

source: can't set unicast hop limit
it: impossibile impostare il limite di hop unicast
zh_hant: 無法設定單播跳數限制

source: can't receive hop limit
it: impossibile ricevere il limite di hop
zh_hant: 無法接收跳數限制

source: can't set flowlabel
it: impossibile impostare flowlabel
zh_hant: 無法設定 flowlabel

source: can't send flowinfo
it: impossibile inviare flowinfo
zh_hant: 無法傳送 flowinfo

source: Destination unreachable:
it: Destinazione non raggiungibile:
zh_hant: 目的地無法連線：

source: No route
it: Nessuna rotta
zh_hant: 無路徑

source: Administratively prohibited
it: Vietato amministrativamente

source: Beyond scope of source address
it: Oltre lo scope dell'indirizzo sorgente
zh_hant: 超出來源位址範圍

source: Address unreachable
it: Indirizzo non raggiungibile
zh_hant: 位址無法連線

source: Port unreachable
it: Porta non raggiungibile
zh_hant: 通訊埠無法連線

source: Source address failed ingress/egress policy
it: L'indirizzo sorgente non ha superato la politica di ingresso/uscita
zh_hant: 來源位址未通過入口/出口政策

source: Reject route to destination
it: Rotta verso la destinazione rifiutata
zh_hant: 拒絕前往目的地的路徑

source: Unknown code %d
it: Codice %d sconosciuto
zh_hant: 未知代碼 %d

source: Packet too big: mtu=%u
it: Pacchetto troppo grande: mtu=%u
zh_hant: 封包太大：mtu=%u

source: , code=%d
it: , codice=%d
zh_hant: , 代碼=%d

source: Time exceeded:
it: Tempo superato:
zh_hant: 超過時間：

source: Hop limit
it: Limite di hop
zh_hant: 跳數限制

source: Defragmentation failure
it: Errore di deframmentazione
zh_hant: 碎片整理失敗

source: code %d
it: codice %d
zh_hant: 代碼 %d

source: Parameter problem:
it: Problema nei parametri:
zh_hant: 參數問題：

source: Wrong header field
it: Campo dell'intestazione errato
zh_hant: 錯誤的標頭欄位

source: Unknown header
it: Intestazione sconosciuta
zh_hant: 未知標頭

source: Unknown option
it: Opzione sconosciuta
zh_hant: 未知選項

source: code %d
it: codice %d
zh_hant: 代碼 %d

source: at %u
it: a %u
zh_hant: 在 %u

source: Echo request
it: Richiesta Echo
zh_hant: 回應請求

source: Echo reply
it: Risposta Echo
zh_hant: 回應回覆

source: MLD Query
it: Interrogazione MLD
zh_hant: MLD 查詢

source: MLD Report
it: Rapporto MLD
zh_hant: MLD 報告

source: MLD Reduction
it: Riduzione MLD
zh_hant: MLD 減少

source: unknown icmp type: %u
it: tipo icmp sconosciuto: %u
zh_hant: 未知的 icmp 類型：%u

source: local error: message too long, mtu: %u
it: errore locale: messaggio troppo lungo, mtu: %u
zh_hant: 本地錯誤：訊息太長，mtu：%u

source: unexpected error in inet_ntop(%s)
it: errore inaspettato in inet_ntop(%s)
zh_hant: inet_ntop(%s) 中的意外錯誤

source: refused
it: rifiutato
zh_hant: 被拒絕

source: unknown
it: sconosciuto
zh_hant: 未知

source: unknown code(%02x)
it: codice sconosciuto(%02x)
zh_hant: 未知代碼(%02x)

source: packet too short: %d bytes
it: pacchetto troppo breve: %d byte
zh_hant: 封包太短：%d 位元組

source: %d data bytes
it: %d byte di dati
zh_hant: %d 資料位元組

source: Usage ping [options] <destination> Options: <destination> DNS name or IP address -3 RTT precision (do not round up the result time) -a use audible ping -A use adaptive ping -B sticky source address -c <count> stop after <count> replies -C call connect() syscall on socket creation -D print timestamps -d use SO_DEBUG socket option -e <identifier> define identifier for ping session, default is random for SOCK_RAW and kernel defined for SOCK_DGRAM Imply using SOCK_RAW (for IPv4 only for identifier 0) -f flood ping -h print help and exit -H force reverse DNS name resolution (useful for numeric destinations or for -f), override -n -I <interface> either interface name or address -i <interval> seconds between sending each packet -j JSON output (experimental) -L suppress loopback of multicast packets -l <preload> send <preload> number of packages while waiting replies -m <mark> tag the packets going out -M <pmtud opt> define path MTU discovery, can be one of <do|dont|want|probe> -n no reverse DNS name resolution, override -H -O report outstanding replies -p <pattern> contents of padding byte -q quiet output -Q <tclass> use quality of service <tclass> bits -s <size> use <size> as number of data bytes to be sent -S <size> use <size> as SO_SNDBUF socket option value -t <ttl> define time to live -U print user-to-user latency -v verbose output -V print version and exit -w <deadline> reply wait <deadline> in seconds -W <timeout> time to wait for response IPv4 options: -4 use IPv4 -b allow pinging broadcast -R record route -T <timestamp> define timestamp, can be one of <tsonly|tsandaddr|tsprespec> IPv6 options: -6 use IPv6 -F <flowlabel> define flow label, default is random -N <nodeinfo opt> use IPv6 node info query, try <help> as argument For more details see ping(8).
it: Uso ping [opzioni] <destinazione> Opzioni: <destinazione> DNS name or IP address -3 RTT precision (do not round up the result time) -a use audible ping -A use adaptive ping -B sticky source address -c <numero> stop after <numero> replies -C call connect() syscall on socket creation -D print timestamps -d use SO_DEBUG socket option -e <identifier> define identifier for ping session, default is random for SOCK_RAW and kernel defined for SOCK_DGRAM Imply using SOCK_RAW (for IPv4 only for identifier 0) -f flood ping -h print help and exit -H force reverse DNS name resolution (useful for numeric destinations or for -f), override -n -I <interfaccia> either interface name or address -i <intervallo> seconds between sending each packet -j JSON output (experimental) -L suppress loopback of multicast packets -l <precarico> send <precarico> number of packages while waiting replies -m <marchio> tag the packets going out -M <opzione pmtud> define path MTU discovery, can be one of <do|dont|want|probe> -n no reverse DNS name resolution, override -H -O report outstanding replies -p <modello> contents of padding byte -q quiet output -Q <tclass> use quality of service <tclass> bits -s <dimensione> use <dimensione> as number of data bytes to be sent -S <dimensione> use <dimensione> as SO_SNDBUF socket option value -t <ttl> define time to live -U print user-to-user latency -v verbose output -V print version and exit -w <scadenza> reply wait <scadenza> in seconds -W <timeout> time to wait for response Opzioni IPv4: -4 use IPv4 -b allow pinging broadcast -R record route -T <timestamp> define timestamp, can be one of <tsonly|tsandaddr|tsprespec> Opzioni IPv6: -6 use IPv6 -F <flowlabel> define flow label, default is random -N <opz nodeinfo> use IPv6 node info query, try <help> as argument Per maggiori dettagli consultare ping(8).

source: patterns must be specified as hex digits: %s
it: i modelli devono essere specificati come cifre esadecimali: %s
zh_hant: 模式必須指定為十六進位數字： %s

source: PATTERN: 0x
it: MODELLO: 0x
zh_hant: 模式：0x

source: no answer yet for icmp_seq=%lu
it: nessuna risposta ancora per icmp_seq=%lu
zh_hant: icmp_seq=%lu 尚未有答案

source: WARNING: buffer size overflow, reduce packet size or preload
it: ATTENZIONE: overflow della dimensione del buffer, ridurre la dimensione del pacchetto o il precarico

source: WARNING: probably, rcvbuf is not enough to hold preload
it: ATTENZIONE: probabilmente rcvbuf non è sufficiente per contenere il precarico
zh_hant: 警告：可能 rcvbuf 不足以容納預先載入的內容

source: WARNING: failed to set mark: %u
it: ATTENZIONE: impostazione del marchio non riuscita: %u
zh_hant: 警告：設定標記失敗：%u

source: => missing cap_net_admin+p or cap_net_raw+p (since Linux 5.17) capability?
it: => manca la capacità cap_net_admin+p o cap_net_raw+p (da Linux 5.17)?
zh_hant: => 缺少 cap_net_admin+p 或 cap_net_raw+p（自 Linux 5.17 起）功能？

source: WARNING: SO_MARK not supported
it: ATTENZIONE: SO_MARK non supportato
zh_hant: 警告：己不支援 SO_MARK

source: cannot flood, minimal interval for user must be >= %d ms, use -i %s (or higher)
it: impossibile eseguire il flood, l'intervallo minimo per l'utente deve essere >= %d ms, usare -i %s (o superiore)
zh_hant: 無法使用泛洪法，使用者的最小間隔必須 >= %d ms，使用 -i %s (或更高)

source: illegal preload and/or interval: %d
it: precarico e/o intervallo non validi: %d
zh_hant: 非法預載和/或間隔：%d

source: Warning: no SO_TIMESTAMP support, falling back to SIOCGSTAMP
it: Attenzione: nessun supporto SO_TIMESTAMP, ripiego su SIOCGSTAMP
zh_hant: 警告： 己不支援 SO_TIMESTAMP，回退到 SIOCGSTAMP

source: Warning: invalid tv_usec %ld us
it: Attenzione: tv_usec %ld us non valido
