Repository: iputils/iputils
Catalog: po/*.po
Languages: it, zh_hant

source: Warning: invalid tv_sec %ld s
it: Attenzione: tv_sec %ld s non valido

source: Warning: time of day goes back (%ld s), taking countermeasures
it: Attenzione: l'ora del giorno torna indietro (%ld s), adozione contromisure in corso

source: %d bytes
it: %d byte

source: from %s:
it: da %s:

source: time=%s ms
it: tempo=%s ms
zh_hant: 時間=%s 毫秒

source: (BAD CHECKSUM!)
it: (CHECKSUM ERRATO!)
zh_hant: （錯誤校驗和）

source: (DIFFERENT ADDRESS!)
it: (INDIRIZZO DIFFERENTE!)
zh_hant: (地址不同!)

source: wrong data byte #%d should be 0x%x but was 0x%x
it: byte di dati #%d errato: dovrebbe essere 0x%x ma era 0x%x

source: %ld/%ld packets, %d%% loss
it: %ld/%ld pacchetti, %d%% persi

source: , min/avg/ewma/max = %ld.%03ld/%lu.%03ld/%d.%03d/%ld.%03ld ms
it: , min/media/ewma/max = %ld.%03ld/%lu.%03ld/%d.%03d/%ld.%03ld ms

source: Overflow during JSON construction
it: Overflow durante la costruzione del JSON

source: From %s icmp_seq=%u
it: Da %s icmp_seq=%u
zh_hant: 來自 %s icmp_seq=%u

source: parse error (%s)
it: errore di analisi (%s)

source: unknown qtype(0x%02x)
it: qtype sconosciuto(0x%02x)
zh_hant: 未知 qtype(0x%02x)

source: (truncated)
it: (troncato)
zh_hant: (己截斷)

source: , flow 0x%05x,
it: , flusso 0x%05x,

source: from %s %s:
it: da %s %s:
zh_hant: 來自 %s %s：

source: rtt min/avg/max/mdev = %s/%s/%s/%s ms
it: rtt min/media/max/mdev = %s/%s/%s/%s ms

source: --- %s ping statistics ---
it: --- statistiche ping %s ---

source: %ld packets transmitted,
it: %ld pacchetti trasmessi,

source: %ld received
it: %ld ricevuti

source: , +%ld duplicates
it: , +%ld duplicati

source: , +%ld corrupted
it: , +%ld corrotti

source: , +%ld errors
it: , +%ld errori
zh_hant: , +%ld 錯誤

source: , %g%% packet loss
it: , %g%% pacchetti persi
zh_hant: , %g%% 封包遺失

source: , time %llums
it: , tempo %llums
zh_hant: , 時間 %llums

source: no info
it: nessuna informazione
zh_hant: 無資訊

source: (This broken router returned corrupted payload)
it: (Questo router difettoso ha restituito un payload corrotto)
zh_hant: (此故障路由器傳回損毀的有效負載)

source: reached
it: raggiunto

source: asymm %2d
it: asimm %2d

source: NET ERROR
it: ERRORE DI RETE
zh_hant: 網路錯誤

source: %2d?: reply received 8)
it: %2d?: risposta ricevuta 8)

source: %2d: send failed
it: %2d: invio non riuscito

source: Usage tracepath [options] <destination> Options: -4 use IPv4 -6 use IPv6 -b print both name and IP -l <length> use packet <length> -m <hops> use maximum <hops> -n no reverse DNS name resolution -p <port> use destination <port> -V print version and exit <destination> DNS name or IP address For more details see tracepath(8).
it: Uso tracepath [opzioni] <destinazione> Opzioni: -4 usa IPv4 -6 usa IPv6 -b stampa sia il nome che l'IP -l <lunghezza> usa pacchetti di <lunghezza> -m <hop> usa al massimo <hop> -n nessuna risoluzione DNS inversa -p <porta> usa la <porta> di destinazione -V stampa la versione ed esce <destinazione> nome DNS o indirizzo IP Per maggiori dettagli consultare tracepath(8).

source: Only one -4 or -6 option may be specified
it: Può essere specificata solo una tra le opzioni -4 o -6
zh_hant: 只能指定一個 -4 或 -6 選項

source: %2d: no reply
it: %2d: nessuna risposta

source: Resume: pmtu %d
it: Ripristino: pmtu %d

source: hops %d
it: hop %d
zh_hant: 跳數 %d

source: back %d
it: ritorno %d

source: pktlen must be within: %d < value <= %d
it: pktlen deve essere compreso tra: %d < valore <= %d

source: Unicast
zh_hant: 單點傳播

source: Broadcast
zh_hant: 廣播

source: Timestamp
zh_hant: 時間戳

source: [LOCALHOST]
zh_hant: [本地]
